Repository: Hamzeali/e2ee-visualization
Catalog: lib/l10n/app_*.arb
Languages: de

# language
source: English
de: Deutsch

# slide1
source: How does an E-Mail work?
de: Wie funktioniert eine E-Mail?

# slide2
source: Who can read my E-mail?
de: Wer kann meine E-Mail lesen?

# slide3
source: Effect of the server settings
de: Auswirkung der Servereinstellungen

# slide4
source: Effect of backup between servers
de: Auswirkung der Sicherung zwischen den Servern

# slide6
source: Effect of backup between servers
de: Auswirkung der Sicherung zwischen den Servern

# slide7
source: Effect of end-to-end encryption
de: Auswirkung der Ende-zu-Ende-Verschlüsselung

# slide8
source: Effect of end-to-end encryption
de: Auswirkung der Ende-zu-Ende-Verschlüsselung

# slide9
source: Asymmetric cryptography - Signing
de: Asymmetrische Kryptographie - Signieren

# slide10
source: Asymmetric cryptography - Signing + Encryption
de: Asymmetrische Kryptographie - Signieren + Verschlüsseln

# slide11
source: Asymmetric cryptography - Summary
de: Asymmetrische Kryptographie - Zusammenfassung

# slide12
source: E-Mail-Security with S/MIMIE
de: E-Mail-Sicherheit mit S/MIME

# slide13
source: E-Mail-Security with S/MIMIE
de: E-Mail-Sicherheit mit S/MIME

source: Outgoing Mail Server
de: Postausgangsserver

source: Inbox server
de: Posteingangsserver

source: Forwarding server
de: Weiterleitungsserver

# skip
source: Skip intro
de: Einführung überspringen

# reset
source: Restart intro
de: Einführung neu starten

# errorTitel
source: Error
de: Fehler

# primeNumberErrorMessage
source: p must be prime number!
de: p muss eine Primzahl sein!

# primitiveRootErrorMessage
source: g must be primitive root of p!
de: g muss primitive Wurzel von p sein!

# emptyErrorMessage
source: Empty values are not accepted!
de: Leere Werte sind nicht erlaubt.

# doneTitel
source: Done
de: Erledigt

# correctMessage
source: The values have been set.
de: Die Werte sind gesetzt.

source: Settings
de: Einstellungen

source: Animation speed
de: Animation-Geschwindigkeit

# appLanguage
source: Language
de: Sprache

# zoomEnable
source: Enable zoom
de: Zoom Aktivieren

source: Secret (Bob)
de: Geheim (Bob)

source: Secret (Alice)
de: Geheim (Alice)

source: Cancel
de: Abbrechen

# introStart
source: Start the Introduction
de: Starten Sie die Einführung

# aliceIntro
source: Hi! I am Alice.
de: Hi! Ich bin Alice.

# bobIntro
source: And I am Bob.
de: Und ich bin Bob.

# malloryIntro
source: And here is Mallory.
de: Und hier ist Mallory.

# appDesc0
source: We (Alice and Bob) would like to communicate securely with each other and we want to use End-to-End encryption to do so.
de: Wir (Alice und Bob) möchten sicher miteinander kommunizieren und wir wollen dazu Ende-zu-Ende-Verschlüsselung benutzen.

# appDesc1
source: In this app we will explain you how secure email works.
de: In dieser App erklären wir Ihnen, wie sichere E-Mail funktioniert.

# appDesc2
source: The application consists of 13 scenes.
de: Die Anwendung besteht aus 13 Szenen.

# firstScene
source: Scene 1 to 6, explain the basic of how the email works and show how you who can read the email on the way to its destination.
de: Szene 1 bis 6, erklären die Funktionsweise der E-Mail und zeigen, wie Sie die E-Mail auf dem Weg zu ihrem Ziel lesen können.

# secondScene
source: Scene 7 and 8 show you the effect of using end-to-end encryption.
de: Die Szenen 7 und 8 zeigen Ihnen, wie sich die Verwendung der Ende-zu-Ende-Verschlüsselung auswirkt.

# thirdScene
source: Scene 9, 10 and 11 explain the asymmetric cryptography using the signature and the encryption.
de: In den Szenen 9, 10 und 11 wird die asymmetrische Kryptographie anhand der Signatur und der Verschlüsselung erläutert.

# fourthScene
source: Scene 12 and 13 show e-mail security with S/MIME and the effect of the server settings respectively.
de: Szene 12 und 13 zeigen die E-Mail-Sicherheit mit S/MIME bzw. die Auswirkungen der Servereinstellungen.

# sceneStart1
source: So let's start the scenes...
de: Beginnen wir also mit den Szenen...

# sceneStart2
source: Start the scenes
de: Szenen starten

source: Secret
de: Geheimzahl

# toolTipRightBtn
source: Next step
de: Nächster Schritt

# toolTipLeftBtn
source: Previous step
de: Vorheriger Schritt

# toolTipMoreBtn
source: More
de: Mehr

# toolTipPlayBtn
source: Play
de: Abspielen

# toolTipResetBtn
source: Reset
de: Zurücksetzen

# toolTipSettingsBtn
source: Settings
de: Einstellungen

# toolTipDescBtn
source: Show description
de: Beschreibung anzeigen

# ref
source: References
de: Referenzen

# wiki
source: End-to-End encryption:
de: Ende-zu-Ende-Verschlüsselung:

# url
source: https://en.wikipedia.org/wiki/End-to-end_encryption
de: https://de.wikipedia.org/wiki/Ende-zu-Ende-Verschlüsselung

# aboutTitle
source: End-to-End Encryption
de: Ende-zu-Ende-Verschlüsselung

# about0
source: What is E2EE?
de: Was ist E2EE?

# about1
source: - Purpose of the Diffie-Hellman Key-Exchange Protocol
de: - Zweck des Diffie-Hellman Key-Exchange-Protokolls

# about2
source: End-to-end encryption (E2EE) is a security method that keeps chats and messages secure. The end-to-end encryption is a system of communication where only the users communicating can read the messages. In principle, it prevents potential eavesdroppers – including telecom providers, Internet providers, malicious actors, and even the provider of the communication service – from being able to access the cryptographic keys needed to decrypt the conversation. End-to-end encryption is intended to prevent data being read or secretly modified, other than by the true sender and recipient(s). The messages are encrypted by the sender but the third party does not have a means to decrypt them, and stores them encrypted. The recipients retrieve the encrypted data and decrypt it themselves. Because no third parties can decipher the data being communicated or stored, for example, companies that provide end-to-end encryption are unable to hand over texts of their customers' messages to the authorities. In 2022, the UK's Information Commissioner's Office, the government body responsible for enforcing online data standards, stated that opposition to E2EE was misinformed and the debate too unbalanced, with too little focus on benefits, since E2EE 'helped keep children safe online' and law enforcement access to stored data on servers was 'not the only way' to find abusers.
de: Die Ende-zu-Ende-Verschlüsselung (E2EE) ist eine Sicherheitsmethode, die Chats und Nachrichten sicher hält. Die Ende-zu-Ende-Verschlüsselung ist ein Kommunikationssystem, bei dem nur die kommunizierenden Nutzer die Nachrichten lesen können. Im Prinzip verhindert sie, dass potenzielle Lauscher - darunter Telekommunikationsanbieter, Internetprovider, böswillige Akteure und sogar der Anbieter des Kommunikationsdienstes - auf die kryptografischen Schlüssel zugreifen können, die zur Entschlüsselung des Gesprächs erforderlich sind. Die Ende-zu-Ende-Verschlüsselung soll verhindern, dass Daten gelesen oder heimlich verändert werden können, außer durch den eigentlichen Absender und den/die Empfänger. Die Nachrichten werden vom Absender verschlüsselt, aber der Dritte hat keine Möglichkeit, sie zu entschlüsseln, und speichert sie verschlüsselt. Die Empfänger rufen die verschlüsselten Daten ab und entschlüsseln sie selbst. Da keine Dritten die übermittelten oder gespeicherten Daten entschlüsseln können, sind Unternehmen, die eine Ende-zu-Ende-Verschlüsselung anbieten, beispielsweise nicht in der Lage, die Texte der Nachrichten ihrer Kunden an die Behörden zu übermitteln. Im Jahr 2022 erklärte das britische Information Commissioner's Office, die für die Durchsetzung von Online-Datenstandards zuständige Regierungsbehörde, dass die Opposition gegen E2EE falsch informiert und die Debatte zu unausgewogen sei und sich zu wenig auf die Vorteile konzentriere, da E2EE 'dazu beitrage, Kinder online sicher zu halten' und der Zugang der Strafverfolgungsbehörden zu den auf den Servern gespeicherten Daten 'nicht der einzige Weg' sei, um Missbraucher zu finden.

# e2ee
source: What is DHKE?
de: Was ist E2EE?

source: Yes
de: Ja

source: No
de: Nein

# showCase0
source: Go one step forward.
de: Gehen Sie einen Schritt nach vorne.

# showCase1
source: Go one step backward.
de: Gehen Sie einen Schritt zurück.

# showCase2
source: Show or hide the description box.
de: Blenden Sie das Beschreibungsfeld ein oder aus.

# showCase3
source: Change the settings of the application.
de: Ändern Sie die Einstellungen der Anwendung.

# showCase4
source: Reset the scene and start from the beginning.
de: Setzen Sie die Szene zurück und beginnen Sie von vorne.

# showCase5
source: Let the app move in automatic mode.
de: Lassen Sie die App im automatischen Modus laufen.

# showCase6
source: It has three buttons inside it.
de: Darin befinden sich drei Knöpfe.

# showCase7
source: Step number. You can press this number and write the step you would like to go to.
de: Schrittnummer. Sie können diese Zahl drücken und den Schritt eingeben, zu dem Sie gehen möchten.

# showCase8
source: In this box you will see some explanations about what happens on the screen.(You can maximize or minimize the box with long press)
de: In diesem Feld sehen Sie einige Erklärungen dazu, was auf dem Bildschirm passiert. (Sie können das Feld durch langes Drücken maximieren oder minimieren)

# outOfRangeError
source: Please enter a valid number.
de: Bitte geben Sie eine gültige Nummer ein.

# goToStep
source: Go to step number:
de: Gehen Sie zu Schrittnummer:

# aboutApp
source: About...
de: Über...

# aboutApp1
source: The Flutter app 'E2EE' was developed in the course of a bachelor thesis by
de: Die Flutter-App 'E2EE' wurde im Zuge einer Bachelorarbeit von

# aboutApp2
source: for the CrypTool project.
de: für das CrypTool-Projekt entwickelt.

# aboutApp3
source: (C) 2023, freeware, open source (Apache 2), CrypTool (
de: (C) 2023, Freeware, Open-Source (gemäß Apache 2), CrypTool

# aboutApp5
source: Last modification / built: 22.03.2023
de: Letzte Änderung / Built: 22.03.2023

source: Message
de: Nachricht

# lastLeft
source: Beginning of the scene!
de: Anfang der Szene!

# lastLeft2
source: Beginning of the scene! Do you want to switch to the previous scene?
de: Anfang der Szene! Möchten Sie zur vorherigen Szene wechseln?

# lastRight
source: End of the scene! Do you want to switch to the next scene?
de: Ende der Szene! Möchten Sie zur nächsten Szene wechseln?

# lastRight2
source: End of the scene! Do you want to go back to the first scene?
de: Ende der Szene! Möchten Sie zur ersten Szene zurückkehren?

# text1
source: Color mixing is a simple analogy that can be used to illustrate the Diffie-Hellman Key Exchange (DHKE) protocol. And in Scene 3, we'll see how it works with numbers.
de: Farbmischungen sind eine einfache Analogie, mit der man das Diffie-Hellman- Schlüsselaustausch-Protokoll (DHKE) veranschaulichen kann. Und in Szene 3 sehen wird dann, wie es mit Zahlen funktioniert.

# text2
source: Choosing a prime number p and a generator g.
de: Auswahl einer Primzahl p und eines Generators g.

# prevOp
source: Previous operation:
de: Vorherige Operation:

# newOp
source: New operation:
de: Neue Operation:

# text31
source: This time with numbers – with small numbers. In practice, DHKE uses large numbers (p > 3000 bit according to the BSI recommendation).
de: Diesmal mit Zahlen – mit kleinen Zahlen. DHKE verwendet in der Praxis große Zahlen (p > 3000 bit laut BSI-Empfehlung).

# text321
source: Alice chooses a large prime number. Let's say she chooses p =
de: Alice wählt eine große Primzahl. Nehmen wir an, sie wählt p =

# text322
source: and a generator g =
de: und ein Generator g =

# text4
source: Man-in-the-middle attack on DHKE: Eve blocks the key exchange between Alice and Bob.
de: Man-in-the-Middle-Angriff auf DHKE: Eve blockiert den Schlüsselaustausch zwischen Alice und Bob.

# slide1Item0
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item1
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item2
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item3
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item4
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item5
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item6
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item7
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item8
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item9
source: Alice and Bob want to communicate with each other over the Internet!
de: Alice und Bob wollen über das Internet miteinander kommunizieren!

# slide1Item10
source: Bob sends a message to the inbox-server.
de: Bob sendet eine Nachricht an den Posteingangsserver.

# slide1Item11
source: Bob sends a message to the inbox-server.
de: Bob sendet eine Nachricht an den Posteingangsserver.

# slide1Item12
source: The inbox-server sends the message to a forwarding-server.
de: Der Posteingangsserver sendet die Nachricht an einen Weiterleitungsserver.

# slide1Item13
source: The inbox-server sends the message to a forwarding-server.
de: Der Posteingangsserver sendet die Nachricht an einen Weiterleitungsserver.

# slide1Item14
source: The forwarding-server forwards the message to an inbox-server near Alice.
de: Der Weiterleitungsserver leitet die Nachricht an einen Posteingangsserver in der Nähe von Alice weiter.

# slide1Item15
source: Alice receives the message from Bob.
de: Alice erhält die Nachricht von Bob.

# slide1Item16
source: Alice receives the message from Bob.
de: Alice erhält die Nachricht von Bob.

# slide3Item0
source: The way between Alice and the inbox-server will be safe.
de: Der Weg zwischen Alice und dem Posteingangsserver wird sicher sein.

# slide3Item1
source: The way between Alice and the inbox-server will be safe.
de: Der Weg zwischen Alice und dem Posteingangsserver wird sicher sein.

# slide3Item2
source: Mallory can not read the message.
de: Mallory kann die Nachricht nicht lesen.

# slide3Item3
source: Mallory can access the message between the servers.
de: Mallory kann auf die Nachricht zwischen den Servern zugreifen.

# slide3Item4
source: Between the inbox-server and Bob the message will be secure.
de: Zwischen dem Posteingangsserver und Bob ist die Nachricht sicher.

# slide3Item5
source: Between the inbox-server and Bob the message will be secure.
de: Zwischen dem Posteingangsserver und Bob ist die Nachricht sicher.

# slide3Item6
source: Between the inbox-server and Bob the message will be secure.
de: Zwischen dem Posteingangsserver und Bob ist die Nachricht sicher.

# slide3Item7
source: Mallory can access the message between the servers.
de: Mallory kann auf die Nachricht zwischen den Servern zugreifen.

# slide3Item8
source: Mallory can access the message between the servers.
de: Mallory kann auf die Nachricht zwischen den Servern zugreifen.

# slide3Item9
source: Between the inbox-server and Alice the message will be secure.
de: Zwischen dem Posteingangsserver und Alice ist die Nachricht sicher.

# slide3Item10
source: Between the inbox-server and Alice the message will be secure.
de: Zwischen dem Posteingangsserver und Alice ist die Nachricht sicher.

# slide3Item11
source: Between the inbox-server and Alice the message will be secure.
de: Zwischen dem Posteingangsserver und Alice ist die Nachricht sicher.

# slide4Item0
source: Between Alice and the server, the message is secure. But once its on the server, Mallory can access the message.
de: Zwischen Alice und dem Server ist die Nachricht sicher. Aber sobald es auf dem Server ist, kann Mallory auf die Nachricht zugreifen.

# slide4Item1
source: Between Alice and the server, the message is secure. But once its on the server, Mallory can access the message.
de: Zwischen Alice und dem Server ist die Nachricht sicher. Aber sobald es auf dem Server ist, kann Mallory auf die Nachricht zugreifen.

# slide4Item2
source: Between Alice and the server, the message is secure. But once its on the server, Mallory can access the message.
de: Zwischen Alice und dem Server ist die Nachricht sicher. Aber sobald es auf dem Server ist, kann Mallory auf die Nachricht zugreifen.

# slide4Item3
source: The way between the servers is now secure and Mallory can not access the message. But again the server is not secure!
de: Der Weg zwischen den Servern ist nun sicher und Mallory kann nicht auf die Nachricht zugreifen. Aber auch hier ist der Server nicht sicher!

# slide4Item4
source: Between the server and Bob, the message is secure.
de: Zwischen dem Server und Bob ist die Nachricht sicher.

# slide4Item5
source: Between the server and Bob, the message is secure.
de: Zwischen dem Server und Bob ist die Nachricht sicher.

# slide4Item6
source: Between Bob and the server, the message is secure. But once its on the server, Mallory can access the message.
de: Zwischen Bob und dem Server ist die Nachricht sicher. Aber sobald es auf dem Server ist, kann Mallory auf die Nachricht zugreifen.

# slide4Item7
source: The way between the servers is secure and Mallory can not access the message. But again the server is not secure!
de: Der Weg zwischen den Servern ist sicher und Mallory kann nicht auf die Nachricht zugreifen. Aber auch hier ist der Server nicht sicher!

# slide4Item8
source: The way between the servers is secure and Mallory can not access the message. But again the server is not secure!
de: Der Weg zwischen den Servern ist sicher und Mallory kann nicht auf die Nachricht zugreifen. Aber auch hier ist der Server nicht sicher!

# slide4Item9
source: Between the server and Alice, the message is secure.
de: Zwischen dem Server und Alice ist die Nachricht sicher.

# slide4Item10
source: Between the server and Alice, the message is secure.
de: Zwischen dem Server und Alice ist die Nachricht sicher.

# slide4Item11
source: Between the server and Alice, the message is secure.
de: Zwischen dem Server und Alice ist die Nachricht sicher.

# slide7Item0
source: With E2EE the servers will be secure. That means Mallory can not access the message even on the server.
de: Mit E2EE werden die Server sicher sein. Das bedeutet, dass Mallory nicht auf dem Server auf die Nachricht zugreifen kann.

# slide7Item1
source: With E2EE the servers will be secure. That means Mallory can not access the message even on the server.
de: Mit E2EE werden die Server sicher sein. Das bedeutet, dass Mallory nicht auf dem Server auf die Nachricht zugreifen kann.

# slide7Item2
source: Alice attaches the message with her certificate.
de: Alice hängt die Nachricht mit ihrem Zertifikat an.

# slide7Item3
source: Alice attaches the message with her certificate.
de: Alice hängt die Nachricht mit ihrem Zertifikat an.

# slide7Item4
source: Alice attaches the message with her certificate.
de: Alice hängt die Nachricht mit ihrem Zertifikat an.

# slide7Item5
source: Alice sends her secured message to the server. Mallory has no access on the server.
de: Alice sendet ihre gesicherte Nachricht an den Server. Mallory hat keinen Zugriff auf den Server.

# slide7Item6
source: The transmission between the servers is also secure.
de: Auch die Übertragung zwischen den Servern ist sicher.

# slide7Item7
source: The way between the server and Bob is also secure.
de: Auch der Weg zwischen dem Server und Bob ist sicher.

# slide7Item8
source: Only Bob can see the content of the message.
de: Nur Bob kann den Inhalt der Nachricht sehen.

# slide8Item0
source: Bob will send his message with E2EE.
de: Bob sendet seine Nachricht mit E2EE.

# slide8Item1
source: Bob attaches the message with his certificate.
de: Bob hängt die Nachricht mit seinem Zertifikat an.

# slide8Item2
source: Bob attaches the message with his certificate.
de: Bob hängt die Nachricht mit seinem Zertifikat an.

# slide8Item3
source: Bob attaches the message with his certificate.
de: Bob hängt die Nachricht mit seinem Zertifikat an.

# slide8Item4
source: Bob sends his secured message to the server. The server is secure and Mallory has no access.
de: Bob sendet seine gesicherte Nachricht an den Server. Der Server ist sicher und Mallory hat keinen Zugriff.

# slide8Item5
source: The transmission between the servers is also secure.
de: Auch die Übertragung zwischen den Servern ist sicher.

# slide8Item6
source: The transmission between the servers is also secure.
de: Auch die Übertragung zwischen den Servern ist sicher.

# slide8Item7
source: Alice receives the message from Bob.
de: Alice erhält die Nachricht von Bob.

# slide8Item8
source: Only Alice can see the content of the message.
de: Nur Alice kann den Inhalt der Nachricht sehen.

# slide8Item9
source: Only Alice can see the content of the message.
de: Nur Alice kann den Inhalt der Nachricht sehen.

# slide8Item10
source: Only Alice can see the content of the message.
de: Nur Alice kann den Inhalt der Nachricht sehen.

# slide12Item0
source: Alice generates a pair of keys (public key and private key).
de: Alice generiert ein Schlüsselpaar (öffentlicher Schlüssel und privater Schlüssel).

# slide12Item1
source: Alice generates a pair of keys (public key and private key).
de: Alice generiert ein Schlüsselpaar (öffentlicher Schlüssel und privater Schlüssel).

# slide12Item2
source: Bob generates a pair of keys (public key and private key).
de: Bob generiert ein Schlüsselpaar (öffentlicher Schlüssel und privater Schlüssel).

# slide12Item3
source: Alice writes her message.
de: Alice schreibt ihre Nachricht.

# slide12Item4
source: Alice encrypts her message with her private key.
de: Alice verschlüsselt ihre Nachricht mit ihrem privaten Schlüssel.

# slide12Item5
source: Alice attaches her public key to her message to send it to Bob.
de: Alice hängt ihren öffentlichen Schlüssel an ihre Nachricht an, um sie an Bob zu senden.

# slide12Item6
source: Alice sends her message to Bob over the servers.
de: Alice sendet ihre Nachricht über die Server an Bob.

# slide12Item7
source: Alice sends her message to Bob over the servers.
de: Alice sendet ihre Nachricht über die Server an Bob.

# slide12Item8
source: Alice sends her message to Bob over the servers.
de: Alice sendet ihre Nachricht über die Server an Bob.

# slide12Item9
source: Bob gets the Alice's public key.
de: Bob erhält den öffentlichen Schlüssel von Alice.

# slide13Item0
source: Bob writes his message.
de: Bob schreibt seine Nachricht.

# slide13Item1
source: Bob encrypts his message with his private key.
de: Bob verschlüsselt seine Nachricht mit seinem privaten Schlüssel.

# slide13Item2
source: Bob attaches his public key to his message to send it to Alice.
de: Bob hängt seinen öffentlichen Schlüssel an seine Nachricht an, um sie an Alice zu senden.

# slide13Item3
source: Bob's public key is enveloped (encrypted) using Alice public key.
de: Bobs öffentlicher Schlüssel wird mit dem öffentlichen Schlüssel von Alice umhüllt (verschlüsselt).
