Repository: Hamzeali/e2ee-visualization
Catalog: lib/l10n/app_*.arb
Languages: de

# slide13Item4
source: Bob's public key is enveloped (encrypted) using Alice public key.
de: Bobs öffentlicher Schlüssel wird mit dem öffentlichen Schlüssel von Alice umhüllt (verschlüsselt).

# slide13Item5
source: The message and the envelope are sent to Alice.
de: Die Nachricht und der Umschlag werden an Alice gesendet.

# slide13Item6
source: The message and the envelope are sent to Alice.
de: Die Nachricht und der Umschlag werden an Alice gesendet.

# slide13Item7
source: The message and the envelope are sent to Alice.
de: Die Nachricht und der Umschlag werden an Alice gesendet.

# slide13Item8
source: The message and the envelope are sent to Alice.
de: Die Nachricht und der Umschlag werden an Alice gesendet.

# slide13Item9
source: Alice opens (decrypts) the envelope using her private key to extract Bob's public key.
de: Alice öffnet (entschlüsselt) den Umschlag mit ihrem privaten Schlüssel, um Bobs öffentlichen Schlüssel zu extrahieren.

# slide13Item10
source: Alice opens (decrypts) the envelope using her private key to extract Bob's public key.
de: Alice öffnet (entschlüsselt) den Umschlag mit ihrem privaten Schlüssel, um Bobs öffentlichen Schlüssel zu extrahieren.

# slide13Item11
source: Alice has Bob's public key.
de: Alice hat Bobs öffentlichen Schlüssel.
